examples/channel_bubble/0_org/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(0.00068185 0.00068185 0.000681849)
(0.000676996 0.000676998 0.000224923)
(0.00067452 0.000222678 0.000222678)
(0.000222108 0.000222108 0.000222108)
(0.000222678 0.00067452 0.000222678)
(0.00022449 0.00114509 0.000224491)
(0.000222338 0.00164057 0.000222339)
(0.000223835 0.00215621 0.000223836)
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.000673633 0.00067363 0.05)
(0.00114434 0.000672199 0.05)
(0.00163903 0.000669779 0.05)
(0.00215341 0.000669455 0.05)
(0.00267735 0.000668947 0.05)
(0.0032025 0.000669231 0.05)
(0.00372247 0.000669272 0.05)
(0.00423655 0.000669406 0.05)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.00067363 0.000673633 0)
(0.00114434 0.000672202 0)
(0.00163903 0.000669781 0)
(0.00215341 0.000669455 0)
(0.00267735 0.000668947 0)
(0.0032025 0.00066923 0)
(0.00372248 0.000669271 0)
(0.00423656 0.000669405 0)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
8000
(
(0 0.00067363 0.000673633)
(0 0.00114434 0.000672201)
(0 0.00163903 0.000669781)
(0 0.00215341 0.000669455)
(0 0.00267735 0.000668947)
(0 0.0032025 0.00066923)
(0 0.00372248 0.000669271)
(0 0.00423656 0.000669405)
...
)
;
    }
}


// ************************************************************************* //
