examples/channel_bubble/0_org/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
0.00068185
0.000676996
0.00067452
0.000222108
0.000222678
0.00022449
0.000222338
0.000223835
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.000673633
0.00114434
0.00163903
0.00215341
0.00267735
0.0032025
0.00372247
0.00423655
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.00067363
0.00114434
0.00163903
0.00215341
0.00267735
0.0032025
0.00372248
0.00423656
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
