examples/channel_bubble/0_org/area
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "0";
    object      area;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   nonuniform List<scalar> 
115600
(
2.15782e-07
2.18392e-07
2.15782e-07
2.15782e-07
2.18392e-07
2.18392e-07
2.07086e-07
2.07087e-07
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
2.11688e-07
2.20429e-07
2.32496e-07
2.37833e-07
2.41113e-07
2.3911e-07
2.36536e-07
2.33855e-07
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
2.11688e-07
2.20429e-07
2.32497e-07
2.37835e-07
2.41114e-07
2.3911e-07
2.36536e-07
2.33855e-07
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
8000
(
2.11688e-07
2.20429e-07
2.32497e-07
2.37835e-07
2.41114e-07
2.3911e-07
2.36536e-07
2.33855e-07
...
)
;
    }
}


// ************************************************************************* //
