examples/channel_bubble/system/FOs/FOwriteCellAreas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

writeCellAreas
{
    type 		    coded;
    libs 		    ("libutilityFunctionObjects.so");
    name 		    writeCellAreas;

    enabled         true;
    log		        true;
    timeStart       0;
    timeEnd         0;
    executeControl  writeTime;
    executeInterval -1;
    writeControl 	writeTime;
    writeInterval   -1;

    codeExecute
    #{
        Info << "Execute writeFaceAreas" <<  endl;

        // get patch id for inlet
        label patchId = mesh().boundaryMesh().findPatchID("inlet");

        surfaceScalarField faceAreas
        (
            IOobject
            (
                "area",                     // file name for output
                mesh().time().timeName(),   // time instance i.e. which time folder
                mesh(),                     // object registry 
                IOobject::NO_READ,          // read option
                IOobject::NO_WRITE,         // write option
                IOobject::NO_REGISTER       // register object
            ),
            mesh().magSf() // initial values //mesh().magSf().boundaryField()[patchId]
        );

        faceAreas.write();
    #};
}


// ************************************************************************* //
