examples/channel_bubble/system/turbulenceLib
"libturbulenceModels.so"
